#pragma once 
/************************************************************************/
/*								 vf00									*/
/************************************************************************/
#define NEW_SHARESTASH						//2012.08.06(vf00)		공용 창고, 정리기능 신규추가

#define CROSSWARS_SYSTEM					//2013.07.29(vf00)		디지몬 크로스워즈 시스템
#define SIMPLE_TOOLTIP						//2013.11.13(vf00)		UI 툴팁

/************************************************************************/
/*								lks007									*/
/************************************************************************/
#define DEBUFF_ITEM							//2013.08.07(lks007)	디버프 아이템
#define CONSIGNMENT_BALLOON_CASH			//2013.12.11(lks007)	위탁 상점 말풍선 캐시 아이템 타입 추가

#define EGG_PREFERMENT						//2014.07.09(lks007)	강용알 스캔하여 나온 아이템으로 한단계 높은 강용알로 교환 (미스터리 머신 사용)


#define CONSIGNMENT_CREATE_RESTRICT			//2015.03.18(lks007)	위탁상점이 NPC 주변 및 포탈 주변의 가까운 위치에 생성되지 않도록... 

/************************************************************************/
/*								chu8820									*/
/************************************************************************/
#define PC_BANG_SERVICE						//2013.08.29(chu8820)	웹젠 PC방 퍼블리싱


#define GUILD_RENEWAL						//2014.06.25(chu8820)	길드 시스템 리뉴얼(길드스킬)


/************************************************************************/
/*							    kimhoshok                               */
/************************************************************************/
#define COSTUME_GENDER						//2014.02.11(kimhoshok)	성별 코스튬 아이템 문자열

#define MAKE_TACTICS_UI_UPGRADE				//2014.05.22(kimhoshok)	디지타마 부화창 중급 데이터 사용 UI 수정

#ifdef MAKE_TACTICS_UI_UPGRADE
#define TACTICS_USE_DATA_LV2				//(kimhoshok)			중급 데이터 사용
//#define TACTICS_USE_DATA_LV3				//(kimhoshok)			엑셀 작업이 안되어 있기 때문에 컬럼 사용을 제한합니다.
//#define TACTICS_USE_DATA_LV4
//#define TACTICS_USE_DATA_LV5
#endif




//=============================================================================
//	덤프 수정 공통 디파인(작업 후 4주 지나면 문제없는것은 삭제)
//=============================================================================
//#define CRASHDUMP_0305							// 2014.03.05 정리한 덤프	// 140422 에 실제 적용됨
//#define CRASHDUMP_0326							// 2014.03.26 정리한 덤프	// 140422 에 실제 적용됨


#define	ITEM_USE_TIME_PASS_FILE						//2017-04-04-nova	시간제아이템

#define SDM_TAMER_XGUAGE_20180628	
#define QUEST_RESET_180712				// X-항체 게이지 및 아이템 사용 관련 디파인 
