
#pragma once

//레지스트리 관련하여 사용하는 함수들모음

namespace REG
{
	/*---------------------------------------------------------------------
	레지스트리로 부터 key값이 존재하는지 체크 
	----------------------------------------------------------------------*/
	BOOL IsRegstry( HKEY hKey, LPCTSTR lpKey );

	/*---------------------------------------------------------------------
	레지스트리로 부터 Int형 값을 읽어들이는 함수
	----------------------------------------------------------------------*/
	 UINT RegReadInt( HKEY hKey, LPCTSTR lpKey,	LPCTSTR lpValue, INT nDefault );

	/*---------------------------------------------------------------------
	레지스트리로 부터 String형 값을 읽어들이는 함수
	----------------------------------------------------------------------*/
	 BOOL RegReadString( HKEY hKey, LPCTSTR lpKey, LPCTSTR lpValue,	LPCTSTR lpDefault, LPTSTR lpRet, DWORD nSize );

	 // 관리자 권한으로 실행 하지 않도록 Write하는 함수 주석처리
	 // 레지스트를 Write할 일이 생기면 주석을 풀고 UAC를 켜야함.
// 	/*---------------------------------------------------------------------
// 	레지스트리로 Int형 값을 쓰는 함수
// 	----------------------------------------------------------------------*/
// 	BOOL RegWriteInt( HKEY hKey, LPCTSTR lpKey, LPCTSTR lpValue, UINT nData );
// 
// 	/*---------------------------------------------------------------------
// 	레지스트리로 String형 값을 쓰는 함수
// 	----------------------------------------------------------------------*/
// 	BOOL RegWriteString( HKEY hKey, LPCTSTR lpKey, LPCTSTR lpValue, LPCTSTR lpData );
// 
// 	/*---------------------------------------------------------------------
// 	레지스트리로 Binary형 값을 쓰는 함수
// 	----------------------------------------------------------------------*/
// 	BOOL RegWriteBinary( HKEY hKey, LPCTSTR lpKey, LPCTSTR lpValue, LPCTSTR lpData,	int size );
// 	
// 	/*---------------------------------------------------------------------
// 	레지스트리 삭제함수
// 	----------------------------------------------------------------------*/
// 	BOOL RegRemoveValue( HKEY hKey, LPCTSTR lpKey, LPCTSTR lpValue );
};

