#pragma once 

/********** 13.08.27 패치 (폭죽) ****************************************/
	//#define FIREWORK							//2013.05.01(khc0729)	폭죽 리뉴얼

/********** 14.03.25 패치 ***********************************************/
	//씰마스터, 재구매, 퀵슬롯, 기적의 사파이어, 도감 추가
	#define LEVELUP_EFFECT_LOOP					//2014.01.23(lks007)	경험치 폭탄(?) 아이템 사용 시 레벨업 이펙트를 상승된 레벨만큼 보여주기
	//2014동계올림픽 복장(남녀구분) 추가
	#define COSTUME_GENDER						//2014.02.11(kimhoshok)	남성 전용, 여성 전용 코스튬 2604, 2605


/********** 14.12.23 패치 ***********************************************/
	//핵쉴드 업데이트(555), 목걸이 번역 추가, Actor 오브젝트 체크 추가



#define SDM_TAMER_XGUAGE_20180628
#define SDM_TAMER_EQUIP_ADD_BRACELET_20181031

#define LJW_ENCHANT_OPTION_DIGIVICE_190904