


#include "stdafx.h"
#include "_Lan_Thailand.h"


TCHAR*	__LanGetString_Thai( TCHAR* str )
{
	size_t nRes = CsFPS::GetHashCode( str );
	switch( nRes )
	{
	case 3574150398:
		/* 마우스를 찾을 수 없습니다. */
		return			L"ไม่พบปฏิกิริยาจากเม้าส์ของคุณ";

	case 170863830:
		/* 키보드를 찾을 수 없습니다. */
		return			L"ไม่พบการตอบสนองของคีย์บอร์ด";

	case 3102853748:
		/* 지원되지 않는 모니터 색 품질입니다. eFrameFormat = %d */
		return			L"ไม่สนับสนุนสีที่เลือก eFrameFormat = %d";

	case 2712967072:
		/* 하드웨어 3D가속을 받지 못합니다. 그래픽 드라이버 or DirectX or D3D가속을 확인해 주십시요. */
		return			L"อุปกรณ์นี้ไม่สนับสนุนภาพแบบ 3มิติ โปรดตรวจสอบที่Driver หรือ DirectX หรือตัวอุปกรณ์";

	case 2170343467:
		/* DirectX 버젼이 9.0 보다 낮습니다. DirectX 버젼을 올려주세요. */
		return			L"เวอชั่น DirectX ของคุณต่ำกว่า 9.0 กรุณาทำการอัพเดทเวอร์ชั่นใหม่";

	case 2230314086:
		/* 현재의 그래픽 카드로는 사양이 낮아 지형이나 케릭터등이 정상적이지 않은 화면으로 보일 수 있습니다. */
		return			L"การ์ดจอของคุณไม่สามารถแสดงผลภาพหรือตัวละครออกมาได้ดีนัก เนื่องจากไม่ผ่านความต้องการของระบบขั้นต่ำ";

	case 2443360582:
		/* 그래픽 카드 사양이 낮아 기본 쉐이더를 사용하겠습니다.\n쉐이더 설정은 그래픽 옵션에서 조절 가능합니다. */
		return			L"เนื่องจากการ์ดจอของคุณต่ำเกินไป จึงปรับให้ใช้ภาพที่ความละเอียดขั้นพื้นฐาน \nคุณสามารถปรับแต่งภาพเพิ่มเติมได้ที่เมนูออฟชั่น";

	case 192517641:
		/* 파일테이블이 잘못 되었습니다 */
		return			L"ตารางไฟล์ผิดพลาด";

	case 1242789363:
		/* 디지몬마스터즈가 이미 실행중에 있습니다.\n불법 프로그램 사용시 불이익을 당할 수 있습니다. */
		return			L"เกม Digimon Masters กำลังเปิดใช้งานอยู่ \nกรุณาตรวจสอบความถูกต้องของตัวเกมที่ติดตั้งอีกครั้ง";

	case 2044459055:
		/*DirectX9.0 버전이 낮습니다. 최신 DirectX를 설치 하시겠습니까?*/
		return L"DirectX ของคุณเป็นเวอร์ชั่นเก่า ต้องการติดตั้ง DirectX เวอร์ชั่นล่าสุดตอนนี้หรือไม่?";

	case 1973959437:
		/* 런쳐에서 실행하여 주십시오!! */
		return			L"เริ่มการทำงาน DMLauncher.exe";

		// 게임가드 관련 문자열
		// 이놈은 UI Text 테이블에 넣으면 안된다.
		// 이유 : 이 문자열을 출력할 때는 테이블 로드 전이기 때문이다.
	case 2182461964:	
		/*게임가드가 실행 중이 아닙니다.*/
		return			L"GameGuardไม่ทำงาน";
	case 3947362763:	
		/*게임가드가 실행 중 입니다. 잠시 후나 재부팅 후에 다시 실행해보시기 바랍니다.*/
		return			L"GameGuard กำลังทำงานอยู่ โปรดรอหรือลองอีกครั้งหลังจาก Restart";
	case 1378959422:	 
		/*게임이 중복 실행되었거나 게임가드가 이미 실행 중 입니다. 게임 종료후 다시 실행해보시기 바랍니다.*/
		return			L"มีการเปิดตัวเกมซ้ำกัน หรือ GameGuard กำลังทำงานอยู่ โปรดลองอีกครั้งหลังจากปิดตัวเกมล่าสุดและ Restart";
	case 3489414536:	 
		/*게임가드 초기화 에러입니다. 재부팅 후 다시 실행해보거나 충돌할 수있는 다른 프로그램들을 종료한 후 실행해 보시기 바랍니다.*/
		return			L"GameGuard พบ Error ระหว่างดำเนินการ ลองอีกครั้งหลังจาก Restart หรือปิดโปรแกรมที่ขัดขวางการทำงานของเกม";
	case 1409890449:	
		/*게임가드 파일이 없거나 변조되었습니다. 게임가드 셋업 파일을 설치해보시기 바랍니다.*/
		return			L"ไฟล์ GameGuard ถูกลบหรือหายไป โปรด install GameGuard ใหม่อีกครั้ง";
	case 2653703415:	
		/*윈도우의 일부 시스템 파일이 손상되었습니다. 인터넷 익스플로러(IE)를\t다시 설치해보시기 바랍니다.*/
		return			L"ไฟล์ Windows บางไฟล์มีปัญหา โปรด install Windows Explorer ใหม่";
	case 1237949768:	 
		/*게임가드 실행에 실패했습니다. 게임가드 셋업 파일을 다시 설치해보시기 바랍니다.*/
		return			L"การเปิด GameGuard ล้มเหลว โปรด install GameGuard ใหม่อีกครั้ง";
	case 2318342878:	
		/*불법 프로그램이 발견되었습니다. 불필요한 프로그램을 종료한 후 다시 실행해보시기 바랍니다.*/
		return			L"พบโปรแกรมที่ไม่ถูกต้อง โปรดปิดโปรแกรมที่ไม่ได้ใช้แล้วลองใหม่อีกครั้ง";
	case 1477149656:	
		/*게임가드 업데이트를 취소하셨습니다. 접속이 계속 되지 않을 경우 인터넷 및 개인 방화벽 설정을 조정해 보시기 바랍니다.*/
		return			L"การอัพเดท GameGuard ถูกยกเลิก ถ้ามีปัญหาการเชื่อมต่อ โปรดเปลี่ยนการตั้งค่าอินเตอร์เน็ต หรือ ไฟร์วอลล์";
	case 2429585766:	
		/*게임가드 업데이트 서버 접속에 실패하였습니다. 잠시 후 다시 접속하거나, 네트웍 상태를 점검해봅니다.*/
		return			L"GameGuard เชื่อมต่อไปยัง Update Server ล้มเหลว โปรดลองใหม่อีกครั้งหรือตรวจสอบระบบเครือข่าย";
	case 1426417480:	
		/*게임가드 초기화 에러 또는 구버젼의 게임가드 파일입니다. 게임가드 셋업파일을 다시 설치하고 게임을 실행해봅니다.*/
		return			L"Error อาจเกิดจากการดำเนินการ GameGuard ล้มเหลว หรือเป็นไฟล์เวอร์ชั่นเก่า โปรด install GameGuard ใหม่แล้วลองอีกครั้ง";
	case 1544598421:	
		/*ini 파일이 없거나 변조되었습니다. 게임가드 셋업 파일을 설치하면 해결할 수 있습니다.*/
		return			L"ไฟล์ .ini file ถูกลบหรือหายไป โปรด install GameGuard ใหม่อีกครั้ง";
	case 274170548:		
		/*npgmup.des 초기화 에러입니다. 게임가드폴더를 삭제후 다시 게임실행을 해봅니다.*/
		return			L"การดำเนินการไฟล์ npgmup.des ผิดพลาด โปรดลบโฟลเดอร์ GameGuard แล้วเปิดเกมใหม่อีกครั้ง";
	case 890072434:		
		/*게임가드 업데이트 서버 접속에 실패하였습니다. 잠시 후 재시도 해보거나, 개인 방화벽이 있다면 설정을 조정해 보시기 바랍니다.*/
		return			L"GameGuard เชื่อมต่อไปยัง Update Server ล้มเหลว โปรดเปลี่ยนการตั้งค่าอินเตอร์เน็ต หรือ ไฟร์วอลล์";
	case 1913749563:	
		/*게임가드 업데이트를 완료하지 못 했습니다. 바이러스 백신을 일시 중시시킨 후 재시도 해보시거나, PC 관리 프로그램을 사용하시면 설정을 조정해 보시기 바랍니다.*/
		return			L"การอัพเดท GameGuard ล้มเหลว โปรดปิดโปรแกรม antivirus แล้วลองใหม่อีกครั้ง";
	case 3404157133:	
		/*바이러스 및 해킹툴 검사 모듈 로딩에 실패 했습니다. 메모리 부족이거나 바이러스에 의한 감염일 수 있습니다.*/
		return			L"การโหลด Virus/Hack tools search module ล้มเหลว อาจเกิดจากมี memory ไม่เพียงพอหรือติดไวรัส";
	case 2877035747:	
		/*게임가드와 충돌 프로그램이 발견되었습니다.*/
		return			L"พบโปรแกรมที่ปิดการทำงานของ GameGuard";
	case 395939174:		
		/*게임가드 실행 중 에러가 발생하였습니다. 게임 폴더 안의 GameGuard폴더에 있는 *.erl 파일들을 DigimonM@inca.co.kr로 첨부하여 메일 보내주시기 바랍니다.*/
		return			L"เกิด Error ขณะเปิด GameGuard โปรดส่ง ไฟล์ *.erl ทางอีเมล์ที่ DigimonM@inca.co.kr (ไฟล์ *.erl พบได้ที่ โฟลเดอร์ GameGuard ในโฟลเดอร์เกม)";
	case 2935271129:	
		/*게임가드 초기화 에러 : %lu*/
		return			L"GameGuard error : %lu";
	case 1944341339:	
		/*스피드핵이 감지되었습니다.*/
		return			L"ตรวจพบการเพิ่มความเร็ว";
	case 1214876551:	
		/*게임핵이 발견되었습니다.*/
		return			L"ตรวจพบการเจาะระบบตัวเกม";
	case 295769150:	
		/*게임이나 게임가드가 변조되었습니다.*/
		return			L"มีการแก้ไขตัวเกมหรือ GameGuard";
		////////////게임가드 관련 문자열 여까지//////////////////////////////////////////////////////////////
	}
	assert_cs( false );

#ifndef _GIVE

	TCHAR szBuf[256];
	_stprintf_s(szBuf, _T("NotFindStr : %s / Hash : %ld"), str, nRes);
	CsMessageBox(MB_OK, szBuf);

#endif
	return L"NoString";
}
